
// "use strict"

// Задача №1
// Що потрапить в консоль?

let someVar = 0;
++someVar;

if (someVar) {
	console.log(someVar);
}

// Answer: 1

// Задача №2
// За допомогою циклу FOR виведіть в консоль 10 рядків:
// Пункт №1
// Пункт №2
// і т.д.
for (let i = 1; i < 11; ++i) {
	console.log(`Пункт №${i}`);
}

// Задача №3
// Що потрапить в консоль ?
if (2 * 20 <= 10 || 30 / 2 < 5 && 10 <= "10" || 20 === "20") {
	console.log('000');
}
// if (false || false && true || false) {
// 	console.log('000');
// }
// if (false || false || false) {
// 	console.log('000');
// }

// Задача №4
// Створіть функцію, яка повертає результат ділення числа a на число b з додаванням рядка "Результат ділення: "
// Викличте функцію передаючі різні значення, у тому числі не передаючи зовсім.
// Функція не має повертати NaN, Infinite або помилку
function division(a, b) {
	return b ? "Результат ділення: " + a / b : "Ділення на 0";
}
console.log(division(10, 5)); // "Результат ділення: 2"
console.log(division(10, 0)); // "Ділення на 0"
console.log(division(10)); // "Ділення на 0"


// Задача №5
// Створіть масив даних - 5 елементів, один з яких число 10
// Обробіть масив за допомогою методу перебору
// Перевіряйте елемент на відповідність числу 10, та у разі відповідності, виводьте в консоль
